InformationRegisters/ПрикрепляемыеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепляемыеФайлы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтроки_</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПрикрепитьФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПрикрепитьФайлы</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ОбещанныеПлатежи</xr:Item>
				<xr:Item>Document.НеподтвержденныеПлатежи</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
				<xr:Item>Catalog.ФССП_ИсполнительноеПроизводство</xr:Item>
				<xr:Item>Document.СудебноеДело</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепляемыеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторКорреспонденции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрикрепляемыеФайлы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Перем НовоеИмяФайла Экспорт;
&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)
	Форма = ПолучитьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента",,ЭтаФорма);
	      
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		Форма.Объект.Объект = Список.Отбор.Элементы[0].ПравоеЗначение;
	КонецЕсли;	
	//Чуров
	ОткрытьФорму(Форма);
	//Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлы(Неопределено);
КонецПроцедуры

&НаСервере
Функция СписокВыборНаСервере(ВыбраннаяСтрока, ПолучитьУИД = Ложь)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрикрепитьФайлыФайлы.Хранилище,
	|	ПрикрепитьФайлыФайлы.УИД
	|ИЗ
	|	Документ.ПрикрепитьФайлы.Файлы КАК ПрикрепитьФайлыФайлы
	|ГДЕ
	|	ПрикрепитьФайлыФайлы.Ссылка = &Ссылка
	|	И ПрикрепитьФайлыФайлы.НомерСтроки = &НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяСтрока.Регистратор);
	Запрос.УстановитьПараметр("НомерСтроки", ВыбраннаяСтрока.НомерСтроки_);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ПолучитьУИД Тогда
		Возврат Результат[0].УИД;
	Иначе
		Возврат Результат[0].Хранилище.Получить();
		//Сообщить(строка(Результат[0].Хранилище.Получить()));
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	////Параметр = Список.Параметры.Элементы.Найти("Должник");		
	////Если Параметры.Отбор.Свойство("ДолговоеОбязательство") Тогда
	////	Параметр.Значение = Параметры.Отбор.ДолговоеОбязательство.Владелец;
	////ИначеЕсли Параметры.Отбор.Свойство("Должник") Тогда
	////	Параметр.Значение = Параметры.Отбор.Должник;
	////	
	////КонецЕсли;
	////Параметр.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	//Чуров
	ПоказатьЗначение(,Элементы.Список.ТекущиеДанные.Регистратор);
	//ОткрытьЗначение(Элементы.Список.ТекущиеДанные.Регистратор);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	//Если Элементы.ТЗ.ВыделенныеСтроки.Количество() = 0 Тогда 		
	//	Сообщение = Новый СообщениеПользователю();
	//	Сообщение.Текст = "Не выбрано ни одной строки, или список пуст!";
	//	Сообщение.Сообщить();	
	//	Возврат;
	//КонецЕсли;
	//
	//КаталогПользователя = РазыменоватьСсылку("ПараметрыСеанса.Пользователь.КаталогФайлов");
	//
	//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	//Диалог.Заголовок = "Выберите каталог";
	//Диалог.МножественныйВыбор = Ложь;
	//Если Не Диалог.Выбрать() Тогда
	//	Возврат;
	//КонецЕсли;
	//Диалог.Каталог = Диалог.Каталог + "\";
	//
	////
	//Для Каждого Стр Из Элементы.ТЗ.ВыделенныеСтроки Цикл		
	//	ВыделСтрока = ТЗ.НайтиПоИдентификатору(Стр);
	//		
	//	//
	//	Флаг_ХранениеНаСервере = РазыменоватьСсылку("Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить()");
	//		
	//	Данные = Неопределено;
	//	Если ОбъектыСервер.РазыменоватьСсылку(ВыделСтрока.ТипФайла, "КешироватьНаКомпьютереПользователя") Тогда
	//		Если Флаг_ХранениеНаСервере Тогда
	//			//Ищем по серверному пути на случай RDP
	//			Файл = Новый Файл(ВыделСтрока.Путь_Куда);
	//			Если Файл.Существует() Тогда
	//				Данные = Файл.ПолноеИмя; 
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если Данные = Неопределено Тогда
	//			//Ищем на локальной машине в темпах
	//			Файл = Новый Файл(ВыделСтрока.ИмяФайла);
	//			Файл = Новый Файл(КаталогПользователя + Строка(ВыделСтрока.УИД) + Файл.Расширение);
	//			Если Файл.Существует() Тогда
	//				Данные = Файл.ПолноеИмя; 
	//			КонецЕсли;					
	//		КонецЕсли;	
	//	КонецЕсли;
	//	
	//	Если Данные = Неопределено Тогда
	//		Структура = Новый Структура("Путь_Куда, Регистратор, УИД", ВыделСтрока.Путь_Куда, ВыделСтрока.Регистратор, 
	//				ВыделСтрока.УИД);
	//		Данные = СписокВыборНаСервере(Флаг_ХранениеНаСервере, Структура);
	//		Если Данные = Неопределено Тогда
	//			Данные = СписокВыборНаСервере(Не Флаг_ХранениеНаСервере, Структура); 
	//			Если Данные = Неопределено Тогда
	//				Сообщить("Файл " + ВыделСтрока.ИмяФайла + " не найден.");
	//				Продолжить;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	//		
	//	Файл = Новый Файл(Диалог.Каталог + ВыделСтрока.ИмяФайла);
	//	Если Файл.Существует() Тогда 
	//		КнопкиДиалога = Новый СписокЗначений();
	//		КнопкиДиалога.Добавить(1, "Перезаписать");
	//		КнопкиДиалога.Добавить(2, "Переименовать");
	//		КнопкиДиалога.Добавить(3, "Пропустить");
	//		Ответ = Вопрос("Файл """ + Файл.Имя + """ уже существует", КнопкиДиалога,,, "Файл существует");
	//		Если Ответ = 1 Тогда
	//			Попытка 
	//				Если ТипЗнч(Данные) = Тип("Строка") Тогда
	//					КопироватьФайл(Данные, Файл.ПолноеИмя);			
	//				Иначе
	//					Данные.Записать(Файл.ПолноеИмя);
	//					Если ОбъектыСервер.РазыменоватьСсылку(ВыделСтрока.ТипФайла, "КешироватьНаКомпьютереПользователя") Тогда
	//						КопироватьФайл(Файл.ПолноеИмя, КаталогПользователя + Строка(ВыделСтрока.УИД) + Файл.Расширение); //копируем в кеш
	//					КонецЕсли;
	//				КонецЕсли;
	//				Сообщить("Перезаписан файл """ + Файл.ПолноеИмя + """.");
	//			Исключение
	//				Сообщить("Не записан файл """ + Файл.ПолноеИмя + """.");
	//				Сообщить(ОписаниеОшибки());
	//				Продолжить;
	//			КонецПопытки;
	//		ИначеЕсли Ответ = 2 Тогда
	//			ВыбЗнач = "";
	//			ОписаниеТипов = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100),);
	//			Если ВвестиЗначение(ВыбЗнач, "Введите новое имя (без расширения!)", ОписаниеТипов) Тогда		
	//				Попытка 
	//					Если ТипЗнч(Данные) = Тип("Строка") Тогда
	//						КопироватьФайл(Данные, Диалог.Каталог + ВыбЗнач + Файл.Расширение);			
	//					Иначе
	//						Данные.Записать(Диалог.Каталог + ВыбЗнач + Файл.Расширение);
	//						Если ОбъектыСервер.РазыменоватьСсылку(ВыделСтрока.ТипФайла, "КешироватьНаКомпьютереПользователя") Тогда
	//							КопироватьФайл(Диалог.Каталог + ВыбЗнач + Файл.Расширение, 
	//									КаталогПользователя + Строка(ВыделСтрока.УИД) + Файл.Расширение); //копируем в кеш
	//						КонецЕсли;
	//					КонецЕсли;
	//					Сообщить("Переименован и записан файл """ + Диалог.Каталог + ВыбЗнач + Файл.Расширение + """.");
	//				Исключение
	//					Сообщить("Не записан файл """ + Диалог.Каталог + ВыбЗнач + Файл.Расширение + """.");
	//					Сообщить(ОписаниеОшибки());
	//					Продолжить;
	//				КонецПопытки;		
	//			КонецЕсли;
	//		Иначе
	//			Продолжить;
	//		КонецЕсли;	
	//		
	//	// файл с таким же именем не существует
	//	Иначе
	//		Попытка 
	//			Если ТипЗнч(Данные) = Тип("Строка") Тогда
	//				КопироватьФайл(Данные, Файл.ПолноеИмя);			
	//			Иначе
	//				Данные.Записать(Файл.ПолноеИмя);
	//				Если ОбъектыСервер.РазыменоватьСсылку(ВыделСтрока.ТипФайла, "КешироватьНаКомпьютереПользователя") Тогда
	//					КопироватьФайл(Файл.ПолноеИмя, КаталогПользователя + Строка(ВыделСтрока.УИД) + Файл.Расширение); //копируем в кеш
	//				КонецЕсли;
	//			КонецЕсли;
	//			Сообщить("Записан файл """ + Файл.ПолноеИмя + """.");				
	//		Исключение
	//			Сообщить("Не записан файл """ + Файл.ПолноеИмя + """.");
	//			Сообщить(ОписаниеОшибки());
	//			Продолжить;
	//		КонецПопытки;
	//	КонецЕсли;		
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлы(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда 		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки, или список пуст!";
		Сообщение.Сообщить();	
		Возврат;
	КонецЕсли;
	#Если Вебклиент Тогда
		Если Не РазыменоватьСсылку("Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить()") Тогда	
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			Диалог.Заголовок = "Выберите каталог";
			Диалог.МножественныйВыбор = Ложь;
			Диалог.Показать(Новый ОписаниеОповещения("ОткрытьФайлыЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
			
		Иначе
			Для Каждого ВыделСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
				Данные = СписокВыборНаСервере(ВыделСтрока, Истина);		
				Файл = Новый Файл(Элементы.Список.ДанныеСтроки(ВыделСтрока).ИмяФайла);
				Каталог = РазыменоватьСсылку("Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить()");
				Если Прав(Каталог, 1) <> "\" Тогда
					Каталог = Каталог + "\";
				КонецЕсли;
				ПутьКФайлу = строка(Каталог + Данные + Файл.Расширение);
				Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
				НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
				//ЗапуститьПриложение(Каталог + Данные + Файл.Расширение);
			КонецЦикла;
		КонецЕсли;
		
	#Иначе
		Если Не РазыменоватьСсылку("Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить()") Тогда	
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			Диалог.Заголовок = "Выберите каталог";
			Диалог.МножественныйВыбор = Ложь;
			Если Диалог.Выбрать() Тогда
				Для Каждого ВыделСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
					Данные = СписокВыборНаСервере(ВыделСтрока);
					ИмяФайла = Элементы.Список.ДанныеСтроки(ВыделСтрока).ИмяФайла;
					Файл = Новый Файл(Диалог.Каталог + "\" + ИмяФайла);
					Если Файл.Существует() Тогда 
						КнопкиДиалога = Новый СписокЗначений;
						КнопкиДиалога.Добавить(1, "Перезаписать");
						КнопкиДиалога.Добавить(2, "Переименовать");
						//Чуров
						ДопПараметры = новый Структура("Диалог, Файл, Данные");
						ДопПараметры.Диалог = Диалог;
						ДопПараметры.Файл = Файл;
						ДопПараметры.Данные = Данные;
						Оповещение = новый ОписаниеОповещения("ПослеОтветаФайлСуществует", ЭтаФорма, ДопПараметры);
						ПоказатьВопрос(Оповещение, "Файл " + Файл.Имя + " уже существует", КнопкиДиалога,,,"Файл существует"); 
						//Ответ = Вопрос("Файл " + Файл.Имя + " уже существует", КнопкиДиалога,,, "Файл существует");
						//Если Ответ = 1 Тогда
						//  	Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
						//	ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
						//Иначе
						//	НовоеИмяФайла = ОткрытьФормуМодально("РегистрСведений.ПрикрепляемыеФайлы.Форма.ФормаПереименования");
						//	Данные.Записать(Диалог.Каталог + "\" + НовоеИмяФайла + Файл.Расширение);
						//	ЗапуститьПриложение(Диалог.Каталог + "\" + НовоеИмяФайла + Файл.Расширение);
						//КонецЕсли;
					Иначе
						Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
						ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			Для Каждого ВыделСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
				Данные = СписокВыборНаСервере(ВыделСтрока, Истина);		
				Файл = Новый Файл(Элементы.Список.ДанныеСтроки(ВыделСтрока).ИмяФайла);
				Каталог = РазыменоватьСсылку("Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить()");
				Если Прав(Каталог, 1) <> "\" Тогда
					Каталог = Каталог + "\";
				КонецЕсли;
				ЗапуститьПриложение(Каталог + Данные + Файл.Расширение);
			КонецЦикла;
		КонецЕсли;	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлыЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Для Каждого ВыделСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
			Данные = СписокВыборНаСервере(ВыделСтрока);
			ИмяФайла = Элементы.Список.ДанныеСтроки(ВыделСтрока).ИмяФайла;
			Файл = Новый Файл(Диалог.Каталог + "\" + ИмяФайла);
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Данные",Данные);
			ДополнительныеПараметры.Вставить("Диалог",Диалог);
			ДополнительныеПараметры.Вставить("Файл",Файл);
			
			//ДополнительныеПараметры.Вставить("Данные, Диалог, Файл",Данные,Диалог, Файл);
			Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("КонецПроверкиСуществования",ЭтаФорма,ДополнительныеПараметры));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&наКлиенте
Процедура ПослеОтветаФайлСуществует(Результат, Параметры) Экспорт  
	Если Результат = 1 Тогда
		ДопПарам = Новый Структура;
		ДопПарам.Вставить("Диалог", Параметры.Диалог);
		ДопПарам.Вставить("Файл",Параметры.Файл);
		КудаЗаписать = Параметры.Диалог.Каталог + "\"  + Параметры.Файл.Имя;
		Параметры.Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписи",ЭтаФорма,ДопПарам),КудаЗаписать);
		//Параметры.Данные.Записать(Параметры.Диалог.Каталог + "\" + Параметры.Файл.Имя);
		//ПутьКФайлу = строка(Параметры.Диалог.Каталог + "\" + Параметры.Файл.Имя);
		//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
		//НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
		
		//ЗапуститьПриложение(Параметры.Диалог.Каталог + "\" + Параметры.Файл.Имя);
	Иначе
		Форма = ОткрытьФорму("РегистрСведений.ПрикрепляемыеФайлы.Форма.ФормаПереименования",,ЭтаФорма,,,,Новый ОписаниеОповещения("ПолучитьНовоеИмяФайла",ЭтаФорма,Параметры));
		//Параметры.Данные.Записать(Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение);
		//ДопПарам = Новый Структура;
		//ДопПарам.Вставить("Диалог", Параметры.Диалог);
		//ДопПарам.Вставить("Файл",Параметры.Файл);
		//КудаЗаписать = Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение;
		//Параметры.Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписи",ЭтаФорма,ДопПарам),КудаЗаписать);
		//ПутьКФайлу = строка(Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение);
		//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
		//НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
		
		//ЗапуститьПриложение(Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПроверкиСуществования(Существует, ДополнительныеПараметры) Экспорт
	Данные = ДополнительныеПараметры.Данные;
	//Сообщить(Строка(Данные));
	Диалог = ДополнительныеПараметры.Диалог;
	Файл = ДополнительныеПараметры.Файл;
	Если Существует Тогда
		КнопкиДиалога = Новый СписокЗначений;
		КнопкиДиалога.Добавить(1, "Перезаписать");
		КнопкиДиалога.Добавить(2, "Переименовать");
		//Чуров
		ДопПараметры = новый Структура("Диалог, Файл, Данные");
		ДопПараметры.Диалог = Диалог;
		ДопПараметры.Файл = Файл;
		ДопПараметры.Данные = Данные;
		Оповещение = новый ОписаниеОповещения("ПослеОтветаФайлСуществует", ЭтаФорма, ДопПараметры);
		ПоказатьВопрос(Оповещение, "Файл " + Файл.Имя + " уже существует", КнопкиДиалога,,,"Файл существует"); 
	Иначе
		ДопПарам = Новый Структура;
		ДопПарам.Вставить("Диалог", Диалог);
		ДопПарам.Вставить("Файл",Файл);
		КудаЗаписать = Диалог.Каталог + "\" + Файл.Имя;
		Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписи",ЭтаФорма,ДопПарам),КудаЗаписать);
	//	Сообщить(КудаЗаписать);
		
		
		//Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
		//ПутьКФайлу = строка(Диалог.Каталог + "\" + Файл.Имя);
		//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
		//НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
		//ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазыменоватьСсылку(Стр)
	Возврат Вычислить(Стр);
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаписи(ДопПарам) Экспорт
	Диалог = ДопПарам.Диалог;
	Файл = ДопПарам.Файл;
	ПутьКФайлу = строка(Диалог.Каталог + "\" + Файл.Имя);
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
	НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(Параметр1,Параметр2) Экспорт
//	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Если ИмяСобытия = "ОК_ПереименованиеФайла" и Источник.ИмяФормы = "РегистрСведений.ПрикрепляемыеФайлы.Форма.ФормаПереименования" Тогда
	//	НовоеИмяФайла = Параметр;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовоеИмяФайла(РезультатЗакрытия,Параметры) Экспорт
	ДопПарам = Новый Структура;
	ДопПарам.Вставить("Диалог", Параметры.Диалог);
	ДопПарам.Вставить("Расширение",Параметры.Файл.Расширение);
	ДопПарам.Вставить("НовоеИмяФайла",РезультатЗакрытия);
	КудаЗаписать = Параметры.Диалог.Каталог + "\" + РезультатЗакрытия + Параметры.Файл.Расширение;
	Параметры.Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписиПереименование",ЭтаФорма,ДопПарам),КудаЗаписать);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗаписиПереименование(ДопПарам) Экспорт
	Диалог = ДопПарам.Диалог;
	Расширение = ДопПарам.Расширение;
	ИмяФайла = ДопПарам.НовоеИмяФайла;
	ПутьКФайлу = строка(Диалог.Каталог + "\" + ИмяФайла+Расширение);
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
	НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
КонецПроцедуры
